---
kind: type
id: T:Autodesk.Revit.DB.Electrical.PowerFactorStateType
source: html/bb418213-600f-ca37-e1a0-a09df497ecac.htm
---
# Autodesk.Revit.DB.Electrical.PowerFactorStateType

An enumerated type listing all the possible power factor state types for a connector object.

## Syntax (C#)
```csharp
public enum PowerFactorStateType
```